drazone = 'America/Denver'  # UTC -6

timelocal = {
    'month': {
        'en': {
            1: 'January',
            2: 'February',
            3: 'March',
            4: 'Apri',
            5: 'May',
            6: 'June',
            7: 'July',
            8: 'August',
            9: 'September',
            10: 'October',
            11: 'November',
            12: 'December',
        },
    },
    'dayofweek': {
        'Hans': {
            0: '星期一',
            1: '星期二',
            2: '星期三',
            3: '星期四',
            4: '星期五',
            5: '星期六',
            6: '星期天',
        },
        'Hant': {
            0: '星期一',
            1: '星期二',
            2: '星期三',
            3: '星期四',
            4: '星期五',
            5: '星期六',
            6: '星期天',
        },
        'en': {
            0: 'Monday',
            1: 'Tuesday',
            2: 'Wednesday',
            3: 'Thursday',
            4: 'Friday',
            5: 'Saturday',
            6: 'Sunday',
        },
        'ja': {
            0: '月曜日',
            1: '火曜日',
            2: '水曜日',
            3: '木曜日',
            4: '金曜日',
            5: '土曜日',
            6: '日曜日',
        }
    },
}

dracalendar = {
    'Hans': '龙约历{}\n\n遗迹：{}\n虚空：\n{}',
    'Hant': '龙约历{}\n\n遺跡：{}\n虛空：\n{}',
    'en': 'Dra\' Calendar {}\n\nRuins: {}\nVoid: \n{}',
    'ja': 'ドラガリ歴{}\n\n遺跡：{}\nヴォイド：\n{}',
}

ruins = {
    0: {
        'symbol': '🔥💧🌲🌚🌝'
    },
    1: {
        'symbol': '🔥'
    },
    2: {
        'symbol': '💧'
    },
    3: {
        'symbol': '🌲'
    },
    4: {
        'symbol': '🌚'
    },
    5: {
        'symbol': '🌝'
    },
    6: {
        'symbol': '🔥💧🌲🌚🌝'
    },
}

void = {
    0: {
        'symbol': '🔥🗿\n💧👵\n🌚🍄\n🌲🐉'
    },
    1: {
        'symbol': '🔥🐉\n💧👵\n🌲🍄\n🌚🗿'
    },
    2: {
        'symbol': '🔥🗿\n🌚🍄\n🌲🐉\n🌝👻'
    },
    3: {
        'symbol': '🔥👻\n🌲🍄\n🌝🗿\n🌝🐅'
    },
    4: {
        'symbol': '🔥🐉\n🌚🍄\n🌝🗿\n🌝👻'
    },
    5: {
        'symbol': '🔥👻\n🔥🐉\n🌲🍄\n🌚🗿\n🌝🐅'
    },
    6: {
        'symbol': '🔥🗿\n💧👵\n🌲🐉\n🌚🍄\n🌝👻'
    },
}
